; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	thermograph0 - mode
	infrared1 - mode
	image2 - mode
	Star0 - direction
	Star1 - direction
	GroundStation3 - direction
	Star10 - direction
	GroundStation14 - direction
	GroundStation12 - direction
	GroundStation8 - direction
	GroundStation11 - direction
	Star6 - direction
	Star5 - direction
	GroundStation4 - direction
	Star13 - direction
	Star7 - direction
	GroundStation2 - direction
	GroundStation9 - direction
	Star15 - direction
	Star16 - direction
	Phenomenon17 - direction
	Phenomenon18 - direction
)
(:init
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 Star7)
	(calibration_target instrument0 Star13)
	(calibration_target instrument0 GroundStation8)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon18)
	(supports instrument1 image2)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation8)
	(supports instrument2 thermograph0)
	(supports instrument2 image2)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation11)
	(calibration_target instrument2 GroundStation12)
	(calibration_target instrument2 GroundStation9)
	(supports instrument3 infrared1)
	(calibration_target instrument3 Star5)
	(calibration_target instrument3 GroundStation8)
	(calibration_target instrument3 GroundStation9)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 image2)
	(supports instrument4 infrared1)
	(calibration_target instrument4 GroundStation11)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation11)
	(supports instrument5 infrared1)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 image2)
	(supports instrument6 infrared1)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 GroundStation4)
	(calibration_target instrument6 Star5)
	(calibration_target instrument6 Star6)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation14)
	(supports instrument7 infrared1)
	(calibration_target instrument7 GroundStation9)
	(calibration_target instrument7 GroundStation2)
	(calibration_target instrument7 Star7)
	(calibration_target instrument7 Star13)
	(supports instrument8 image2)
	(calibration_target instrument8 GroundStation9)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star1)
)
(:goal (and
	(pointing satellite3 GroundStation9)
	(have_image Star15 thermograph0)
	(have_image Star16 image2)
	(have_image Phenomenon17 infrared1)
	(have_image Phenomenon18 image2)
))

)

; plan
1. (turn_to satellite3 groundstation9 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 groundstation9)
   goals met: 1 of 5
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 5
3. (calibrate satellite1 instrument2 groundstation11)
   added: (calibrated instrument2)
   goals met: 1 of 5
4. (turn_to satellite1 phenomenon18 groundstation11)
   deleted: (pointing satellite1 groundstation11)
   added: (pointing satellite1 phenomenon18)
   goals met: 1 of 5
5. (take_image satellite1 phenomenon18 instrument2 image2)
   added: (have_image phenomenon18 image2)
   goals met: 2 of 5
6. (turn_to satellite1 phenomenon17 phenomenon18)
   deleted: (pointing satellite1 phenomenon18)
   added: (pointing satellite1 phenomenon17)
   goals met: 2 of 5
7. (take_image satellite1 phenomenon17 instrument2 infrared1)
   added: (have_image phenomenon17 infrared1)
   goals met: 3 of 5
8. (turn_to satellite1 star15 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 star15)
   goals met: 3 of 5
9. (take_image satellite1 star15 instrument2 thermograph0)
   added: (have_image star15 thermograph0)
   goals met: 4 of 5
10. (turn_to satellite1 star16 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 star16)
   goals met: 4 of 5
11. (take_image satellite1 star16 instrument2 image2)
   added: (have_image star16 image2)
   goals met: 5 of 5
